Repository: mcldev/djangocms-animate-on-scroll
Catalog: djangocms_animate_on_scroll/locale/*/LC_MESSAGES/django.po
Languages: fr

source: AnimateOnScroll - Anchor
fr: AnimateOnScroll - Ancre

source: AnimateOnScroll - Element
fr: AnimateOnScroll - Élément

source: AOS Anchor settings
fr: AOS paramètres de l'ancre

source: AOS Advanced settings
fr: AOS paramètres avancés

source: Advanced Element settings
fr: Paramètres avancés de l'élément

source: Yes
fr: Oui

source: No
fr: Non

source: ID name
fr: ID

source: Script will trigger "animation_name" animation on this element, if you scroll to it.
fr: Le script déclenchera l'animation choisie sur cet élément, si vous le faites défiler.

source: Anchor Easing
fr: Easing de l'ancre

source: Choose timing function to ease elements in different ways
fr: Choisir une fonction de temporisation

source: Anchor Placement
fr: Placement de l'ancre

source: Anchor placement - which one position of element on the screen should trigger animation
fr: Placement de l'ancre - quelle position de l'élément sur l'écran doit déclencher l'animation

source: Animate On Scroll Anchor
fr: Animate On Scroll Ancre

source: Anchor element, whose offset will be counted to trigger animation instead of actual elements offset
fr: Élément d'ancrage, dont le décalage sera compté pour déclencher l'animation au lieu du décalage des éléments réels

source: Offset
fr: Décalage

source: Change offset to trigger animations sooner or later (px)
fr: Modifier le décalage pour déclencher les animations plus tôt ou plus tard (px)

source: Duration
fr: Durée

source: Duration of animation (ms)
fr: Durée de l'animation (ms)

source: Delay
fr: Délai

source: Delay animation (ms)
fr: Retarder l'animation (ms)

source: Once
fr: Une fois

source: Choose whether animation should fire once, or every time you scroll down to element
fr: Choisissez si l'animation doit se déclencher une fois ou à chaque fois que vous faites défiler l'élément

source: Mirror
fr: Miroir

source: Choose whether the elements should animate in reverse when they leave the screen
fr: Choisissez si les éléments doivent s'animer en sens inverse lorsqu'ils quittent l'écran

source: Additional classes
fr: Classes supplémentaires

source: Additional comma separated list of classes to be added to the element e.g. "row, column-12, clearfix".
fr: Liste supplémentaire, séparée par des virgules, des classes à ajouter à l'élément, par exemple "row, column-12, clearfix".

source: Attributes
fr: Attributs
